" ******************************************************************************
" ******************************************************************************
"
"                           Share Plugin
"
" ******************************************************************************
" ******************************************************************************


" ------------------------------------------------------------------------------
" nerdtree
" 树状文件目录
Plug 'preservim/nerdtree'


" ------------------------------------------------------------------------------
" vim-nerdtree-sync
" 同步NERDTree到当前编辑文件
Plug 'unkiwii/vim-nerdtree-sync'


" ------------------------------------------------------------------------------
" nerdtree-git-plugin
" 树状文件目录Git插件
Plug 'xuyuanp/nerdtree-git-plugin'


" ------------------------------------------------------------------------------
" nerdcommenter
" <Leader>cc 注释
" <Leader>u  取消注释
Plug 'scrooloose/nerdcommenter'


" ------------------------------------------------------------------------------
" Commentary
" gcgc切换注释
Plug 'tpope/vim-commentary'


" ------------------------------------------------------------------------------
" Tagbar
" 显示代码标签结构
Plug 'majutsushi/tagbar'


" ------------------------------------------------------------------------------
" vim-airline
" Airline状态栏主题
Plug 'vim-airline/vim-airline'
Plug 'vim-airline/vim-airline-themes'


" ------------------------------------------------------------------------------
" ctrlp
" 模糊查找
Plug 'kien/ctrlp.vim'


" ------------------------------------------------------------------------------
" fzf
" 并行化模糊查找
Plug 'junegunn/fzf', { 'dir': '~/.fzf', 'do': './install --all' }


" ------------------------------------------------------------------------------
" vim-highlighter
" 单词高亮
" f<CR>   新增高亮
" f<BS>   删除高亮
" f<C-L>  清除高亮
" f<C-Tag>查找高亮
Plug 'azabiong/vim-highlighter'


" ------------------------------------------------------------------------------
" vim-smooth-scroll
" 平滑滚动
Plug 'terryma/vim-smooth-scroll'


" ------------------------------------------------------------------------------
" rainbow
" 彩虹括号
Plug 'luochen1990/rainbow'


" ------------------------------------------------------------------------------
" ctags
Plug 'universal-ctags/ctags'


" ------------------------------------------------------------------------------
" gitgutter
" 显示Git修改内容
" 有个替代品：signify
" Plug 'airblade/vim-gitgutter'


" ------------------------------------------------------------------------------
" fugitive
" 显示Git修改内容
Plug 'tpope/vim-fugitive'


" ------------------------------------------------------------------------------
" onedark
" onedark深色主题
Plug 'joshdick/onedark.vim'


" ------------------------------------------------------------------------------
" vim-startify
" 开始界面显示Recent
Plug 'mhinz/vim-startify'


" ------------------------------------------------------------------------------
" vim-signify
" 显示Git和SVN修改过的文件
Plug 'mhinz/vim-signify', { 'branch': 'legacy' }


" ------------------------------------------------------------------------------
" vim-git
" 显示Git commit日志的高亮
Plug 'tpope/vim-git'


" ------------------------------------------------------------------------------
" supertab
Plug 'https://github.com/ervandew/supertab.git'
